software/index.org
#+TITLE: Software
#+AUTHOR: Edwin Hu
#+OPTIONS: ':t
#+HTML_HEAD_EXTRA: <link rel="stylesheet" href="https://latex.vercel.app/style.css">

* Some command line tools worth learning

** [[https://prefix.dev/docs/pixi/][~pixi~]]

I recommend [[https://prefix.dev/docs/pixi/][~pixi~]], a modern, fast environment and package manager for the Python ecosystem, in the place of ~anaconda~ and ~conda~. ~pixi~ is cross-platform, supports both Python and R, resolves environments quickly, and uses the familiar ~conda-forge~ ecosystem for package sourcing. It also manages all dependencies—including binaries and libraries—making installation and environment reproduction seamless.

Older tools like ~anaconda~ and ~conda~ are still widely used, but ~pixi~ has a much smoother workflow and improved speed. Instead of heavy base installs (~anaconda~), you define lightweight, reproducible environments in a ~pixi.toml~ file. This ensures all your dependencies are explicit and portable.

A minimal example for a Python data analysis environment:

#+BEGIN_SRC toml
[project]
name = "myenv"

[dependencies]
python = "3.11"
jupyter = "*"
pandas = "*"
numpy = "*"
scipy = "*"
scikit-learn = "*"
#+END_SRC

You can also run program without installing them:
#+BEGIN_SRC sh
pixi run jupyter-console
#+END_SRC

Another neat trick is that you can use ~pixi-pack~ to build an environment on one machine and deploy it to another machine. That means no need for more complicated tools like ~docker~.

*** [[https://github.com/astral-sh/uv][~uv~]]

Where you might have used ~pip~ for Python package management, I now recommend [[https://github.com/astral-sh/uv][~uv~]]. ~uv~ is a fast drop-in replacement for ~pip~. It performs lightning-fast installs, resolves dependencies robustly, and is compatible with both ~requirements.txt~ and ~pyproject.toml~ workflows.

Like ~pixi~, ~uv~ works by adding packages to your virtual environment, and can also run a tool without installing using ~uvx~.


*** ~conda~ for ~R~

Yes I know, this is blasphemy. However, sometimes just getting a basic ~R~
installation up and running can take some time, as you might run into issues
getting things to compile correctly on your system. In fact, getting ~R~ set up
on different machines is what drove me to switch to python and to try ~anaconda~
in the first place. ~anaconda~ has actually [[https://docs.anaconda.com/anaconda/user-guide/tasks/using-r-language/][supported ~R~]] for years now, and
just like with python it is an easy way to get started. Plus, with projects like
[[https://irkernel.github.io/][~IRkernel~]], which allows you to run ~R~ kernels in ~jupyter notebook~ it is a
pretty good way to do interactive data analysis. Most ~R~ packages can be
installed via ~conda~ with ~r-[package name]~.

Much like ~anaconda~ for python, I recommend that new ~R~ users start with
~tidyverse~, and ~data.table~ for getting started with data analysis:
#+BEGIN_SRC sh
conda install r-base r-essentials r-irkernel r-tidyverse r-data.table
#+END_SRC

If, like me, you find yourself constantly playing with different ~R~ packages
then you may actually want to rely on ~R~'s built-in ~install.packages()~, or
the ~devtools::install_github~ included in ~tidyverse~. This may seem
counterintuitive, as I have (hopefully) just convinced you that ~pixi~ is the
best tool for package management in every context--but just as you may want to
fall back on ~pip~ for python, you may find it easier to just use the default
package manager in ~R~ /after/ you do your initial ~pixi install~.


** [[https://curl.haxx.se/][~curl~]]

These days much of the data you will want to analyze lives on the web. If you
want to get this data you will run into terms like HTTP, FTP, REST APIs, JSON.
If you want to work with these things you should probably learn ~curl~.

The basic usage of ~curl~ is simple, yet endlessly customizable:
#+BEGIN_SRC sh
curl [options] [URL...]
#+END_SRC

Why ~curl~ over something like ~wget~? ~curl~ by default writes to ~STDOUT~,
while ~wget~ writes directly to disk. This gives ~curl~ a significant advantage
in being a flexible utility in between pipes.

Bonus tip: [[https://anaconda.org/conda-forge/curl][~curl~ is available in ~conda-forge~]].


** [[https://stedolan.github.io/jq/][~jq~]]

~jq~ is like ~awk~ but specifically for json files. It is fast, flexible, and
plays nicely with your other command-line tools.

It is extremely useful for pretty-printing your json files, and can be easily
used to glob multiple files. The more advanced syntax including ~select/map~
can help you explore very complex files in just a few lines of code.

Bonus tip: [[https://anaconda.org/conda-forge/jq][~jq~ is available in ~conda-forge~]].

** [[http://xmlstar.sourceforge.net/overview.php][~xmlstarlet~]]

~xmlstarlet~ is like ~awk/sed/grep~ for XML files.

It is extremely useful for browsing the structure of your XML files (~xmlstarlet
el~), and subsequently extract the relevant information (~xmlstarlet sel~). It
is written in ~C~ so it is very fast.

