software/index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2025-05-28 Wed 01:41 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Software</title>
<meta name="author" content="Edwin Hu" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="https://latex.vercel.app/style.css">
</head>
<body>
<div id="content" class="content">
<h1 class="title">Software</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgfc87150">1. Some command line tools worth learning</a>
<ul>
<li><a href="#org8d01057">1.1. <code>pixi</code></a>
<ul>
<li><a href="#orga664181">1.1.1. <code>uv</code></a></li>
<li><a href="#org8433fce">1.1.2. <code>conda</code> for <code>R</code></a></li>
</ul>
</li>
<li><a href="#orgcf07546">1.2. <code>curl</code></a></li>
<li><a href="#org815abf3">1.3. <code>jq</code></a></li>
<li><a href="#orgedc91a3">1.4. <code>xmlstarlet</code></a></li>
<li><a href="#orgeb54b43">1.5. <code>xan</code></a></li>
<li><a href="#orgd6f03d9">1.6. <code>Rclone</code></a></li>
<li><a href="#orgdce4424">1.7. <code>GNU parallel</code></a></li>
<li><a href="#orgf691aed">1.8. Other great CLI tools</a></li>
</ul>
</li>
<li><a href="#org7025b2d">2. Some python libraries worth learning</a>
<ul>
<li><a href="#org6cc5008">2.1. <code>requests</code></a></li>
<li><a href="#org97f793b">2.2. <code>asyncio</code></a></li>
<li><a href="#orga482c41">2.3. <code>pandas</code></a></li>
<li><a href="#orga662bf6">2.4. <code>ujson</code></a></li>
<li><a href="#orgf10c6f3">2.5. <code>benedict</code></a></li>
<li><a href="#orgc4abae3">2.6. <code>numba</code></a></li>
</ul>
</li>
<li><a href="#org792e937">3. Some <code>R</code> libraries worth learning</a>
<ul>
<li><a href="#org6fddaac">3.1. <code>tidyverse</code></a></li>
<li><a href="#org66d254e">3.2. <code>data.table</code></a></li>
<li><a href="#org42703c4">3.3. <code>felm</code> and <code>alpaca</code></a></li>
</ul>
</li>
<li><a href="#org24d6fcb">4. Other Useful Software</a>
<ul>
<li><a href="#org783575b">4.1. <code>DuckDB</code></a></li>
<li><a href="#org101cf4f">4.2. <code>ScrapingBee</code></a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-orgfc87150" class="outline-2">
<h2 id="orgfc87150"><span class="section-number-2">1.</span> Some command line tools worth learning</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org8d01057" class="outline-3">
<h3 id="org8d01057"><span class="section-number-3">1.1.</span> <a href="https://prefix.dev/docs/pixi/"><code>pixi</code></a></h3>
<div class="outline-text-3" id="text-1-1">
<p>
I recommend <a href="https://prefix.dev/docs/pixi/"><code>pixi</code></a>, a modern, fast environment and package manager for the Python ecosystem, in the place of <code>anaconda</code> and <code>conda</code>. <code>pixi</code> is cross-platform, supports both Python and R, resolves environments quickly, and uses the familiar <code>conda-forge</code> ecosystem for package sourcing. It also manages all dependencies—including binaries and libraries—making installation and environment reproduction seamless.
</p>

<p>
Older tools like <code>anaconda</code> and <code>conda</code> are still widely used, but <code>pixi</code> has a much smoother workflow and improved speed. Instead of heavy base installs (<code>anaconda</code>), you define lightweight, reproducible environments in a <code>pixi.toml</code> file. This ensures all your dependencies are explicit and portable.
</p>

<p>
A minimal example for a Python data analysis environment:
</p>

<div class="org-src-container">
<pre class="src src-toml">[<span style="color: #ffc777;">project</span>]
<span style="color: #ff98a4;">name</span> = <span style="color: #c3e88d;">"myenv"</span>

[<span style="color: #ffc777;">dependencies</span>]
<span style="color: #ff98a4;">python</span> = <span style="color: #c3e88d;">"3.11"</span>
<span style="color: #ff98a4;">jupyter</span> = <span style="color: #c3e88d;">"*"</span>
<span style="color: #ff98a4;">pandas</span> = <span style="color: #c3e88d;">"*"</span>
<span style="color: #ff98a4;">numpy</span> = <span style="color: #c3e88d;">"*"</span>
<span style="color: #ff98a4;">scipy</span> = <span style="color: #c3e88d;">"*"</span>
<span style="color: #ff98a4;">scikit-learn</span> = <span style="color: #c3e88d;">"*"</span>
</pre>
</div>

<p>
You can also run program without installing them:
</p>
<div class="org-src-container">
<pre class="src src-sh">pixi run jupyter-console
</pre>
</div>

<p>
Another neat trick is that you can use <code>pixi-pack</code> to build an environment on one machine and deploy it to another machine. That means no need for more complicated tools like <code>docker</code>.
</p>
</div>
<div id="outline-container-orga664181" class="outline-4">
<h4 id="orga664181"><span class="section-number-4">1.1.1.</span> <a href="https://github.com/astral-sh/uv"><code>uv</code></a></h4>
<div class="outline-text-4" id="text-1-1-1">
<p>
Where you might have used <code>pip</code> for Python package management, I now recommend <a href="https://github.com/astral-sh/uv"><code>uv</code></a>. <code>uv</code> is a fast drop-in replacement for <code>pip</code>. It performs lightning-fast installs, resolves dependencies robustly, and is compatible with both <code>requirements.txt</code> and <code>pyproject.toml</code> workflows.
</p>

<p>
Like <code>pixi</code>, <code>uv</code> works by adding packages to your virtual environment, and can also run a tool without installing using <code>uvx</code>.
</p>
</div>
</div>
<div id="outline-container-org8433fce" class="outline-4">
<h4 id="org8433fce"><span class="section-number-4">1.1.2.</span> <code>conda</code> for <code>R</code></h4>
<div class="outline-text-4" id="text-1-1-2">
<p>
Yes I know, this is blasphemy. However, sometimes just getting a basic <code>R</code>
installation up and running can take some time, as you might run into issues
getting things to compile correctly on your system. In fact, getting <code>R</code> set up
on different machines is what drove me to switch to python and to try <code>anaconda</code>
in the first place. <code>anaconda</code> has actually <a href="https://docs.anaconda.com/anaconda/user-guide/tasks/using-r-language/">supported <code>R</code></a> for years now, and
just like with python it is an easy way to get started. Plus, with projects like
<a href="https://irkernel.github.io/"><code>IRkernel</code></a>, which allows you to run <code>R</code> kernels in <code>jupyter notebook</code> it is a
pretty good way to do interactive data analysis. Most <code>R</code> packages can be
installed via <code>conda</code> with <code>r-[package name]</code>.
</p>

<p>
Much like <code>anaconda</code> for python, I recommend that new <code>R</code> users start with
<code>tidyverse</code>, and <code>data.table</code> for getting started with data analysis:
</p>
<div class="org-src-container">
<pre class="src src-sh">conda install r-base r-essentials r-irkernel r-tidyverse r-data.table
</pre>
</div>

<p>
If, like me, you find yourself constantly playing with different <code>R</code> packages
then you may actually want to rely on <code>R</code>&rsquo;s built-in <code>install.packages()</code>, or
the <code>devtools::install_github</code> included in <code>tidyverse</code>. This may seem
counterintuitive, as I have (hopefully) just convinced you that <code>pixi</code> is the
best tool for package management in every context&#x2013;but just as you may want to
fall back on <code>pip</code> for python, you may find it easier to just use the default
package manager in <code>R</code> <i>after</i> you do your initial <code>pixi install</code>.
</p>
</div>
</div>
</div>
<div id="outline-container-orgcf07546" class="outline-3">
<h3 id="orgcf07546"><span class="section-number-3">1.2.</span> <a href="https://curl.haxx.se/"><code>curl</code></a></h3>
<div class="outline-text-3" id="text-1-2">
<p>
These days much of the data you will want to analyze lives on the web. If you
want to get this data you will run into terms like HTTP, FTP, REST APIs, JSON.
If you want to work with these things you should probably learn <code>curl</code>.
</p>

<p>
The basic usage of <code>curl</code> is simple, yet endlessly customizable:
</p>
<div class="org-src-container">
<pre class="src src-sh"><span style="color: #ffc777;">curl</span> <span style="color: #c099ff;">[</span>options<span style="color: #c099ff;">]</span> <span style="color: #c099ff;">[</span>URL...<span style="color: #c099ff;">]</span>
</pre>
</div>

<p>
Why <code>curl</code> over something like <code>wget</code>? <code>curl</code> by default writes to <code>STDOUT</code>,
while <code>wget</code> writes directly to disk. This gives <code>curl</code> a significant advantage
in being a flexible utility in between pipes.
</p>

<p>
Bonus tip: <a href="https://anaconda.org/conda-forge/curl"><code>curl</code> is available in <code>conda-forge</code></a>.
</p>
</div>
</div>
<div id="outline-container-org815abf3" class="outline-3">
<h3 id="org815abf3"><span class="section-number-3">1.3.</span> <a href="https://stedolan.github.io/jq/"><code>jq</code></a></h3>
<div class="outline-text-3" id="text-1-3">
<p>
<code>jq</code> is like <code>awk</code> but specifically for json files. It is fast, flexible, and
plays nicely with your other command-line tools.
</p>

<p>
It is extremely useful for pretty-printing your json files, and can be easily
used to glob multiple files. The more advanced syntax including <code>select/map</code>
can help you explore very complex files in just a few lines of code.
</p>

<p>
Bonus tip: <a href="https://anaconda.org/conda-forge/jq"><code>jq</code> is available in <code>conda-forge</code></a>.
</p>
</div>
</div>
<div id="outline-container-orgedc91a3" class="outline-3">
<h3 id="orgedc91a3"><span class="section-number-3">1.4.</span> <a href="http://xmlstar.sourceforge.net/overview.php"><code>xmlstarlet</code></a></h3>
<div class="outline-text-3" id="text-1-4">
<p>
<code>xmlstarlet</code> is like <code>awk/sed/grep</code> for XML files.
</p>

<p>
It is extremely useful for browsing the structure of your XML files (<code>xmlstarlet
el</code>), and subsequently extract the relevant information (<code>xmlstarlet sel</code>). It
is written in <code>C</code> so it is very fast.
</p>
</div>
</div>
