software/index.org
** [[https://github.com/amethysts/xan][~xan~]]

Oftentimes you need to look through a csv file through the command line, and
maybe you even want to do some basic analysis. Enter ~xan~, which is written in
Rust and is extremely fast and capable. ~xan~ can quickly filter, join, pretty
print, etc. a csv, which makes it an invaluable tool.

I used to recommend ~csvkit~ which is written in python, but the performance of
~xan~ has convinced me to switch for good.

** [[https://rclone.org/][~Rclone~]]

Rclone is a command-line tool for accessing data located in cloud storage, including common enterprise tools like Box, Dropbox, or Google Drive.

It's fairly easy to use because it has commands that should be familiar to most unix users. Moreover, it is pretty fast.

It also happens to be installed by default on WRDS (/usr/bin/rclone).

** [[https://www.gnu.org/software/parallel/][~GNU parallel~]]

~GNU parallel~ is a great command line utility written in Perl which allows for
very fine-tuned control over parallelization. If you are familiar with something
like ~xargs~, then ~parallel~ is like a more robust, scalable version of
~xargs~.

Admittedly the learning curve for ~parallel~ can be a bit high, but it makes
replacing serial loops with parallel tasks very easy.

Suppose you have a script ~SOMETHING~ which you want to run over a list of ~csv~
files in your current directory:
#+BEGIN_SRC sh
for i in $(find *.csv); do
    ./SOMETHING $i
done
#+END_SRC

One way to easily parallelize this in ~bash~ is to add ~&~:
#+BEGIN_SRC sh
for i in $(find *.csv); do
    ./SOMETHING $i &
done
#+END_SRC

You could also accomplish the same task with a pipe:
#+BEGIN_SRC sh
find *.csv | ./SOMETHING
#+END_SRC
or if the number of ~csv~ files is large you can use ~xargs~:
#+BEGIN_SRC sh
find *.csv | xargs ./SOMETHING
#+END_SRC

If you want more fine tuned control, such as over the number of concurrent jobs,
then that is where ~parallel~ comes in:
#+BEGIN_SRC sh
find *.csv | parallel -j8 ./SOMETHING
#+END_SRC

~parallel~ is very powerful, and can handle things like parsing arguments, and
handle concurrent writing in a safe way. Suppose that your input is a pipe
delimited file that you want to pass as arugments to your script and output to a
single file:
#+BEGIN_SRC sh
cat INPUT.csv | parallel --colsep '\|' "./SOMETHING {1} {2}" > OUTPUT.csv
#+END_SRC

Just remember you ~bash~ quoting rules and you will be fine!

**  Other great CLI tools

- [[https://github.com/junegunn/fzf][~fzf~]] for fuzzy finding stuff.
- [[https://github.com/ogham/exa][~exa~]] which is like a more advanced ~ls~.
- [[https://github.com/aristocratos/btop][~btop~]] which is a prettier ~htop~.
- [[https://github.com/BurntSushi/ripgrep][~ripgrep~]] which is a very fast ~grep~ search from the developer of ~xsv~.
- [[https://github.com/sxyazi/yazi][~yazi~]] which is a fast file manager.
- [[https://github.com/ajeetdsouza/zoxide][~zoxide~]] which is a more advanced ~cd~.

* Some python libraries worth learning

**  [[https://requests.readthedocs.io/en/master/][~requests~]]

~requests~ is a dead-simple HTTP library for python. Like ~curl~ it is an essential
building tool for working with data that lives on the web (aka scraping).

For example, many websites are now built around REST APIs and deliver JSON
payloads. Rather than scraping HTML with something like [[https://www.crummy.com/software/BeautifulSoup/bs4/doc/][~BeautifulSoup~]], [[https://lxml.de/][~lxml~]],
or worst of all [[https://www.selenium.dev/][~Selenium~]] you can save yourself a lot of time and preserve your
sanity by just using ~requests~ to get at the underlying data. All you need is the
Inspect window of your browser, and some patience and soon you will be an API
scraping master.

Bonus tip: https://curl.trillworks.com/ is a great website that converts ~curl~
statements into ~requests~ code. This is especially useful because some browsers
allow you to copy the results of HTTP requests into ~curl~, which you can easily
convert into ~requests~ code!

** [[https://docs.python.org/3/library/asyncio.html][~asyncio~]]

~asyncio~ is part of the python standard library as of python 3.4. It is a library
for running concurrent (single-threaded) code, and brings python to the
forefront of event-driven programming. That is a fancy way of saying that it is
a neat library that can help you write highly parallel code, help you write your
own network apps, or even write some pretty fancy scrapers.

~asyncio~ has spawned its own ecosystem of libraries, such as [[https://docs.aiohttp.org/en/stable/][~aiohttp~]] which is
like a async version of [[https://requests.readthedocs.io/en/master/][~requests~]], and [[https://github.com/Tinche/aiofiles][~aiofiles~]] for dealing with the
filesystem asynchronously.

** [[https://pandas.pydata.org/][~pandas~]]

You have data. You use python. If these conditions apply, then you should use
~pandas~. The genius of ~pandas~ is that provides a ~DataFrame~, an indexed,
two-dimensional, potentially heterogeneous and hierarchical table of rows and
columns. In all likelihood 99% of the data you analyze with statistical
techniques will fit into the ~DataFrame~ structure, and ~pandas~ makes working with
~DataFrames~ a breeze with powerful functions for data serialization and
transformation.

** [[https://github.com/ultrajson/ultrajson][~ujson~]]

~ujson~ stands for UltraJSON, which is an ultra fast JSON serializer written in C
with python bindings. For most applications you can use it as a drop-in
replacement for the default python ~json~ module, which is written in pure python
and as such is slower.

