software/index.html
<div id="outline-container-orgeb54b43" class="outline-3">
<h3 id="orgeb54b43"><span class="section-number-3">1.5.</span> <a href="https://github.com/amethysts/xan"><code>xan</code></a></h3>
<div class="outline-text-3" id="text-1-5">
<p>
Oftentimes you need to look through a csv file through the command line, and
maybe you even want to do some basic analysis. Enter <code>xan</code>, which is written in
Rust and is extremely fast and capable. <code>xan</code> can quickly filter, join, pretty
print, etc. a csv, which makes it an invaluable tool.
</p>

<p>
I used to recommend <code>csvkit</code> which is written in python, but the performance of
<code>xan</code> has convinced me to switch for good.
</p>
</div>
</div>
<div id="outline-container-orgd6f03d9" class="outline-3">
<h3 id="orgd6f03d9"><span class="section-number-3">1.6.</span> <a href="https://rclone.org/"><code>Rclone</code></a></h3>
<div class="outline-text-3" id="text-1-6">
<p>
Rclone is a command-line tool for accessing data located in cloud storage, including common enterprise tools like Box, Dropbox, or Google Drive.
</p>

<p>
It&rsquo;s fairly easy to use because it has commands that should be familiar to most unix users. Moreover, it is pretty fast.
</p>

<p>
It also happens to be installed by default on WRDS (/usr/bin/rclone).
</p>
</div>
</div>
<div id="outline-container-orgdce4424" class="outline-3">
<h3 id="orgdce4424"><span class="section-number-3">1.7.</span> <a href="https://www.gnu.org/software/parallel/"><code>GNU parallel</code></a></h3>
<div class="outline-text-3" id="text-1-7">
<p>
<code>GNU parallel</code> is a great command line utility written in Perl which allows for
very fine-tuned control over parallelization. If you are familiar with something
like <code>xargs</code>, then <code>parallel</code> is like a more robust, scalable version of
<code>xargs</code>.
</p>

<p>
Admittedly the learning curve for <code>parallel</code> can be a bit high, but it makes
replacing serial loops with parallel tasks very easy.
</p>

<p>
Suppose you have a script <code>SOMETHING</code> which you want to run over a list of <code>csv</code>
files in your current directory:
</p>
<div class="org-src-container">
<pre class="src src-sh"><span style="color: #c099ff;">for</span> i<span style="color: #c099ff;"> in</span> $<span style="color: #c099ff;">(</span><span style="color: #ffc777;">find</span> *.csv<span style="color: #c099ff;">)</span>; <span style="color: #c099ff;">do</span>
    ./SOMETHING $<span style="color: #ff98a4;">i</span>
<span style="color: #c099ff;">done</span>
</pre>
</div>

<p>
One way to easily parallelize this in <code>bash</code> is to add <code>&amp;</code>:
</p>
<div class="org-src-container">
<pre class="src src-sh"><span style="color: #c099ff;">for</span> i<span style="color: #c099ff;"> in</span> $<span style="color: #c099ff;">(</span><span style="color: #ffc777;">find</span> *.csv<span style="color: #c099ff;">)</span>; <span style="color: #c099ff;">do</span>
    ./SOMETHING $<span style="color: #ff98a4;">i</span> &amp;
<span style="color: #c099ff;">done</span>
</pre>
</div>

<p>
You could also accomplish the same task with a pipe:
</p>
<div class="org-src-container">
<pre class="src src-sh"><span style="color: #ffc777;">find</span> *.csv | ./SOMETHING
</pre>
</div>
<p>
or if the number of <code>csv</code> files is large you can use <code>xargs</code>:
</p>
<div class="org-src-container">
<pre class="src src-sh"><span style="color: #ffc777;">find</span> *.csv | xargs ./SOMETHING
</pre>
</div>

<p>
If you want more fine tuned control, such as over the number of concurrent jobs,
then that is where <code>parallel</code> comes in:
</p>
<div class="org-src-container">
<pre class="src src-sh"><span style="color: #ffc777;">find</span> *.csv | parallel -j8 ./SOMETHING
</pre>
</div>

<p>
<code>parallel</code> is very powerful, and can handle things like parsing arguments, and
handle concurrent writing in a safe way. Suppose that your input is a pipe
delimited file that you want to pass as arugments to your script and output to a
single file:
</p>
<div class="org-src-container">
<pre class="src src-sh"><span style="color: #ffc777;">cat</span> INPUT.csv | parallel --colsep <span style="color: #c3e88d;">'\|'</span> <span style="color: #c3e88d;">"./SOMETHING {1} {2}"</span> &gt; OUTPUT.csv
</pre>
</div>

<p>
Just remember you <code>bash</code> quoting rules and you will be fine!
</p>
</div>
</div>
<div id="outline-container-orgf691aed" class="outline-3">
<h3 id="orgf691aed"><span class="section-number-3">1.8.</span> Other great CLI tools</h3>
<div class="outline-text-3" id="text-1-8">
<ul class="org-ul">
<li><a href="https://github.com/junegunn/fzf"><code>fzf</code></a> for fuzzy finding stuff.</li>
<li><a href="https://github.com/ogham/exa"><code>exa</code></a> which is like a more advanced <code>ls</code>.</li>
<li><a href="https://github.com/aristocratos/btop"><code>btop</code></a> which is a prettier <code>htop</code>.</li>
<li><a href="https://github.com/BurntSushi/ripgrep"><code>ripgrep</code></a> which is a very fast <code>grep</code> search from the developer of <code>xsv</code>.</li>
<li><a href="https://github.com/sxyazi/yazi"><code>yazi</code></a> which is a fast file manager.</li>
<li><a href="https://github.com/ajeetdsouza/zoxide"><code>zoxide</code></a> which is a more advanced <code>cd</code>.</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org7025b2d" class="outline-2">
<h2 id="org7025b2d"><span class="section-number-2">2.</span> Some python libraries worth learning</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-org6cc5008" class="outline-3">
<h3 id="org6cc5008"><span class="section-number-3">2.1.</span> <a href="https://requests.readthedocs.io/en/master/"><code>requests</code></a></h3>
<div class="outline-text-3" id="text-2-1">
<p>
<code>requests</code> is a dead-simple HTTP library for python. Like <code>curl</code> it is an essential
building tool for working with data that lives on the web (aka scraping).
</p>

<p>
For example, many websites are now built around REST APIs and deliver JSON
payloads. Rather than scraping HTML with something like <a href="https://www.crummy.com/software/BeautifulSoup/bs4/doc/"><code>BeautifulSoup</code></a>, <a href="https://lxml.de/"><code>lxml</code></a>,
or worst of all <a href="https://www.selenium.dev/"><code>Selenium</code></a> you can save yourself a lot of time and preserve your
sanity by just using <code>requests</code> to get at the underlying data. All you need is the
Inspect window of your browser, and some patience and soon you will be an API
scraping master.
</p>

<p>
Bonus tip: <a href="https://curl.trillworks.com/">https://curl.trillworks.com/</a> is a great website that converts <code>curl</code>
statements into <code>requests</code> code. This is especially useful because some browsers
allow you to copy the results of HTTP requests into <code>curl</code>, which you can easily
convert into <code>requests</code> code!
</p>
</div>
</div>
<div id="outline-container-org97f793b" class="outline-3">
<h3 id="org97f793b"><span class="section-number-3">2.2.</span> <a href="https://docs.python.org/3/library/asyncio.html"><code>asyncio</code></a></h3>
<div class="outline-text-3" id="text-2-2">
<p>
<code>asyncio</code> is part of the python standard library as of python 3.4. It is a library
for running concurrent (single-threaded) code, and brings python to the
forefront of event-driven programming. That is a fancy way of saying that it is
a neat library that can help you write highly parallel code, help you write your
own network apps, or even write some pretty fancy scrapers.
</p>

<p>
<code>asyncio</code> has spawned its own ecosystem of libraries, such as <a href="https://docs.aiohttp.org/en/stable/"><code>aiohttp</code></a> which is
like a async version of <a href="https://requests.readthedocs.io/en/master/"><code>requests</code></a>, and <a href="https://github.com/Tinche/aiofiles"><code>aiofiles</code></a> for dealing with the
filesystem asynchronously.
</p>
</div>
</div>
<div id="outline-container-orga482c41" class="outline-3">
<h3 id="orga482c41"><span class="section-number-3">2.3.</span> <a href="https://pandas.pydata.org/"><code>pandas</code></a></h3>
<div class="outline-text-3" id="text-2-3">
<p>
You have data. You use python. If these conditions apply, then you should use
<code>pandas</code>. The genius of <code>pandas</code> is that provides a <code>DataFrame</code>, an indexed,
two-dimensional, potentially heterogeneous and hierarchical table of rows and
columns. In all likelihood 99% of the data you analyze with statistical
techniques will fit into the <code>DataFrame</code> structure, and <code>pandas</code> makes working with
<code>DataFrames</code> a breeze with powerful functions for data serialization and
transformation.
</p>
</div>
</div>
<div id="outline-container-orga662bf6" class="outline-3">
<h3 id="orga662bf6"><span class="section-number-3">2.4.</span> <a href="https://github.com/ultrajson/ultrajson"><code>ujson</code></a></h3>
<div class="outline-text-3" id="text-2-4">
<p>
<code>ujson</code> stands for UltraJSON, which is an ultra fast JSON serializer written in C
with python bindings. For most applications you can use it as a drop-in
replacement for the default python <code>json</code> module, which is written in pure python
and as such is slower.
</p>
</div>
</div>
