software/index.org
** [[https://github.com/fabiocaccamo/python-benedict][~benedict~]]

~benedict~ is a python dictionary subclass that makes navigating dictionaries in
python a lot easier. In many ways it is like [[https://www.crummy.com/software/BeautifulSoup/bs4/doc/][~BeautifulSoup~]], which is very good
at working with irregular or malformed HTML/XML data, but for python
dictionaries, and JSON-like data. It is not as full-featured as many of the
libraries on this list, but it can be very useful if you are working with
irregular JSON data.

** [[http://numba.pydata.org/][~numba~]]

At first glance, ~numba~ seems like an odd choice for python users. The appeal of
python is that it is an interpreted language, and hence does not need to be
compiled to run. ~numba~ is a compiler for python code. However, it is an easy to
use, just-in-time (JIT) compiler using the LLVM compiler library. That means
that it can take very simple python and ~numpy~ code and turn it into LLVM
compiled code that is nearly as fast as C or FORTRAN code.

A good use case for ~numba~ is taking an expensive matrix multiplication and
re-writing it as a loop. This may seem counterintuitive as the whole point of
~numpy~ is to abstract away from slow python loops for optimized abstracted matrix
operations. Yet these dumb, slow python loops combined with ~numba~ can be
significantly faster than ~numpy~ counterparts if used correctly.


* Some ~R~ libraries worth learning

** [[https://www.tidyverse.org/][~tidyverse~]]

~tidyverse~ is a metapackage of data analysis tools for ~R~. In many ways it is
like the ~anaconda~ default installation in that it includes so many of the
essentials. To get started analyzing data in a modern ~R~ setup you will likely
need ~ggplot2~, ~dplyr~, ~stringr~, and ~purrr~ just to name a few. All of these
are part of ~tidyverse~.

~tidyverse~ also contains one of the most useful packages in any language:
~haven~, which allows you to read ~SAS~ and ~Stata~ files. Look, we can all
pretend like we don't have co-authors that use these languages, or we can deal
with it and use ~haven~.


** [[https://cran.r-project.org/web/packages/data.table/vignettes/datatable-intro.html][~data.table~]]

~data.table~ is [[https://github.com/Rdatatable/data.table/wiki/Benchmarks-%3A-Grouping][very fast]], and has an intuitive syntax. It is certainly
different from ~tidyverse::dplyr~, but for those familiar with ~pandas~,
PyTable, or ~sql~ it may be more intuitive.

Bonus tip: DataCamp has a great [[https://s3.amazonaws.com/assets.datacamp.com/blog_assets/datatable_Cheat_Sheet_R.pdf][cheat sheet]] for ~data.table~.


** [[https://www.rdocumentation.org/packages/lfe/versions/2.8-6/topics/felm][~felm~]] and [[https://github.com/amrei-stammann/alpaca][~alpaca~]]

~felm~ and ~alpaca~ are R packages for linear/logistic regressions with high
dimensional fixed effects and clustered standard errors. Both are available on
CRAN, and are fairly well documented.

* Other Useful Software

** [[https://duckdb.org/][~DuckDB~]]

~DuckDB~ is a SQL-style database with very convenient syntax for data analysis. It
works very well with standard tabular data formats, and plays nicely with
python. It is also very fast for analytic workflows, including read/write and
processing data. One of the most useful features is the variety of built-in
datatypes, such as ~LIST~ and ~STRUCT~ which map to python/JSON datatypes. It also
allows for nested or composite datatypes, which are often found in real-world
data. By default, ~DuckDB~ operates in-memory databases. In many ways, it is like
~SQLite~ but designed for data analysis workflows. It also features a lot of
useful extensions whic facilitate full text search, JSON querying,
reading/writing remote files over HTTP, and reading from ~Postgres/SQLite~
databases.

~DuckDB~ now plays nicely with both python and R, and with their respective
dataframes. It is also very very good at reading all sorts of common data files
like csv, json, and parquet.

** [[https://www.scrapingbee.com/][~ScrapingBee~]]

Sometimes the only way to get data is through traditional web scraping. Scraping
is [[https://cdn.ca9.uscourts.gov/datastore/opinions/2022/04/18/17-16783.pdf][controversial]] and at the very least most websites have some sort of rate
limiting or bot restrictions. Other websites are weirdly designed and require
javascript rendering to be able to access content. ~ScrapingBee~ handles the
former by providing headless instances that imitate a real Chrome browser,
running through different proxies (including residential IP addresses) and the
latter through custom javascript rendering. Thus, ~ScrapingBee~ makes scraping
/much much/ easier in the modern age.

Unlike the rest of the tools on this page, ~ScrapingBee~ is a service you have to
pay for. But the rates are fairly reasonable considering that spinning up a
custom solution (e.g., multiple AWS instances) is costly and time-consuming.
Best of all ~ScrapingBee~ is fairly easy to use. If you can write a simple
~requests~ script (see above), then converting it to use ~ScrapingBee~ is trivial.
Last but not least, ~ScrapingBee~ only charges you for successful requests, so if
their proxies get blocked it doesn't cost you any additional money.

*Warning:* If you pay for a higher tier with concurrency, do not follow the
~ScrapingBee~ tutorials and try to use ~multiprocessing~ or ~concurrent.futures~ for
parallelism. Although it is syntactically simple, they run into the Python GIL
and will lock after a few iterations. Instead, use ~aiohttp~ and just replace the
url field with the ~ScrapingBee~ url, include your API Key as a parameter, and the
url you want to scrape as another parameter.
