software/index.html
<div id="outline-container-orgf10c6f3" class="outline-3">
<h3 id="orgf10c6f3"><span class="section-number-3">2.5.</span> <a href="https://github.com/fabiocaccamo/python-benedict"><code>benedict</code></a></h3>
<div class="outline-text-3" id="text-2-5">
<p>
<code>benedict</code> is a python dictionary subclass that makes navigating dictionaries in
python a lot easier. In many ways it is like <a href="https://www.crummy.com/software/BeautifulSoup/bs4/doc/"><code>BeautifulSoup</code></a>, which is very good
at working with irregular or malformed HTML/XML data, but for python
dictionaries, and JSON-like data. It is not as full-featured as many of the
libraries on this list, but it can be very useful if you are working with
irregular JSON data.
</p>
</div>
</div>
<div id="outline-container-orgc4abae3" class="outline-3">
<h3 id="orgc4abae3"><span class="section-number-3">2.6.</span> <a href="http://numba.pydata.org/"><code>numba</code></a></h3>
<div class="outline-text-3" id="text-2-6">
<p>
At first glance, <code>numba</code> seems like an odd choice for python users. The appeal of
python is that it is an interpreted language, and hence does not need to be
compiled to run. <code>numba</code> is a compiler for python code. However, it is an easy to
use, just-in-time (JIT) compiler using the LLVM compiler library. That means
that it can take very simple python and <code>numpy</code> code and turn it into LLVM
compiled code that is nearly as fast as C or FORTRAN code.
</p>

<p>
A good use case for <code>numba</code> is taking an expensive matrix multiplication and
re-writing it as a loop. This may seem counterintuitive as the whole point of
<code>numpy</code> is to abstract away from slow python loops for optimized abstracted matrix
operations. Yet these dumb, slow python loops combined with <code>numba</code> can be
significantly faster than <code>numpy</code> counterparts if used correctly.
</p>
</div>
</div>
</div>
<div id="outline-container-org792e937" class="outline-2">
<h2 id="org792e937"><span class="section-number-2">3.</span> Some <code>R</code> libraries worth learning</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-org6fddaac" class="outline-3">
<h3 id="org6fddaac"><span class="section-number-3">3.1.</span> <a href="https://www.tidyverse.org/"><code>tidyverse</code></a></h3>
<div class="outline-text-3" id="text-3-1">
<p>
<code>tidyverse</code> is a metapackage of data analysis tools for <code>R</code>. In many ways it is
like the <code>anaconda</code> default installation in that it includes so many of the
essentials. To get started analyzing data in a modern <code>R</code> setup you will likely
need <code>ggplot2</code>, <code>dplyr</code>, <code>stringr</code>, and <code>purrr</code> just to name a few. All of these
are part of <code>tidyverse</code>.
</p>

<p>
<code>tidyverse</code> also contains one of the most useful packages in any language:
<code>haven</code>, which allows you to read <code>SAS</code> and <code>Stata</code> files. Look, we can all
pretend like we don&rsquo;t have co-authors that use these languages, or we can deal
with it and use <code>haven</code>.
</p>
</div>
</div>
<div id="outline-container-org66d254e" class="outline-3">
<h3 id="org66d254e"><span class="section-number-3">3.2.</span> <a href="https://cran.r-project.org/web/packages/data.table/vignettes/datatable-intro.html"><code>data.table</code></a></h3>
<div class="outline-text-3" id="text-3-2">
<p>
<code>data.table</code> is <a href="https://github.com/Rdatatable/data.table/wiki/Benchmarks-%3A-Grouping">very fast</a>, and has an intuitive syntax. It is certainly
different from <code>tidyverse::dplyr</code>, but for those familiar with <code>pandas</code>,
PyTable, or <code>sql</code> it may be more intuitive.
</p>

<p>
Bonus tip: DataCamp has a great <a href="https://s3.amazonaws.com/assets.datacamp.com/blog_assets/datatable_Cheat_Sheet_R.pdf">cheat sheet</a> for <code>data.table</code>.
</p>
</div>
</div>
<div id="outline-container-org42703c4" class="outline-3">
<h3 id="org42703c4"><span class="section-number-3">3.3.</span> <a href="https://www.rdocumentation.org/packages/lfe/versions/2.8-6/topics/felm"><code>felm</code></a> and <a href="https://github.com/amrei-stammann/alpaca"><code>alpaca</code></a></h3>
<div class="outline-text-3" id="text-3-3">
<p>
<code>felm</code> and <code>alpaca</code> are R packages for linear/logistic regressions with high
dimensional fixed effects and clustered standard errors. Both are available on
CRAN, and are fairly well documented.
</p>
</div>
</div>
</div>
<div id="outline-container-org24d6fcb" class="outline-2">
<h2 id="org24d6fcb"><span class="section-number-2">4.</span> Other Useful Software</h2>
<div class="outline-text-2" id="text-4">
</div>
<div id="outline-container-org783575b" class="outline-3">
<h3 id="org783575b"><span class="section-number-3">4.1.</span> <a href="https://duckdb.org/"><code>DuckDB</code></a></h3>
<div class="outline-text-3" id="text-4-1">
<p>
<code>DuckDB</code> is a SQL-style database with very convenient syntax for data analysis. It
works very well with standard tabular data formats, and plays nicely with
python. It is also very fast for analytic workflows, including read/write and
processing data. One of the most useful features is the variety of built-in
datatypes, such as <code>LIST</code> and <code>STRUCT</code> which map to python/JSON datatypes. It also
allows for nested or composite datatypes, which are often found in real-world
data. By default, <code>DuckDB</code> operates in-memory databases. In many ways, it is like
<code>SQLite</code> but designed for data analysis workflows. It also features a lot of
useful extensions whic facilitate full text search, JSON querying,
reading/writing remote files over HTTP, and reading from <code>Postgres/SQLite</code>
databases.
</p>

<p>
<code>DuckDB</code> now plays nicely with both python and R, and with their respective
dataframes. It is also very very good at reading all sorts of common data files
like csv, json, and parquet.
</p>
</div>
</div>
<div id="outline-container-org101cf4f" class="outline-3">
<h3 id="org101cf4f"><span class="section-number-3">4.2.</span> <a href="https://www.scrapingbee.com/"><code>ScrapingBee</code></a></h3>
<div class="outline-text-3" id="text-4-2">
<p>
Sometimes the only way to get data is through traditional web scraping. Scraping
is <a href="https://cdn.ca9.uscourts.gov/datastore/opinions/2022/04/18/17-16783.pdf">controversial</a> and at the very least most websites have some sort of rate
limiting or bot restrictions. Other websites are weirdly designed and require
javascript rendering to be able to access content. <code>ScrapingBee</code> handles the
former by providing headless instances that imitate a real Chrome browser,
running through different proxies (including residential IP addresses) and the
latter through custom javascript rendering. Thus, <code>ScrapingBee</code> makes scraping
<i>much much</i> easier in the modern age.
</p>

<p>
Unlike the rest of the tools on this page, <code>ScrapingBee</code> is a service you have to
pay for. But the rates are fairly reasonable considering that spinning up a
custom solution (e.g., multiple AWS instances) is costly and time-consuming.
Best of all <code>ScrapingBee</code> is fairly easy to use. If you can write a simple
<code>requests</code> script (see above), then converting it to use <code>ScrapingBee</code> is trivial.
Last but not least, <code>ScrapingBee</code> only charges you for successful requests, so if
their proxies get blocked it doesn&rsquo;t cost you any additional money.
</p>

<p>
<b>Warning:</b> If you pay for a higher tier with concurrency, do not follow the
<code>ScrapingBee</code> tutorials and try to use <code>multiprocessing</code> or <code>concurrent.futures</code> for
parallelism. Although it is syntactically simple, they run into the Python GIL
and will lock after a few iterations. Instead, use <code>aiohttp</code> and just replace the
url field with the <code>ScrapingBee</code> url, include your API Key as a parameter, and the
url you want to scrape as another parameter.
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Edwin Hu</p>
<p class="date">Created: 2025-05-28 Wed 01:41</p>
</div>
</body>
</html>
